#include <iostream>
#include <fstream>
#include <cmath>
#include <cstdlib>

using namespace std;

int main(int argc, char const *argv[]) {
    // === Дано:
    int a = 8; // нач.
    int b = 196; // конечн.
    int n = 93; // всего точек
    int ind = 0;
    double j = 0, trap, centrect, simp, o;
    int h = (b-a)/n;
    double P[n], K[n], O[n];
    double arrx[n];//записываем исходные значения x
    double arry[n];//записываем исходные значения y
    double area = 0;

    //  === Загр. точек
    ifstream file ("dots.txt");
    for(int i = 0; i <= n; i++) {
        file >> arrx[i];
        file >> arry[i];
    }
    cout<<'\n';

    // === Производные
    for(int i = 1; i < n; i++) {
        P[ind] = arry[i] - arry[i-1];
        P[ind] /= h;
        j = j + P[ind];
        ind++;
    }
    ind = 0;
    for(int i = 0; i < n; i++) {
        K[ind] = (P[i+1] - P[i]) / h;
        trap += K[ind];
        ind++;
    }
    ind = 0;
    for(int i = 0; i < n; i++) {
        O[ind] = (K[i+1] - K[i]) / h;
        o += O[ind];
        ind++;
    }
    // === Погрешность
    centrect = (trap*pow(h,2))/24;// центральные прямоугольники
    simp = (o*pow(h,3))/288;// Симпсон
    trap = (trap*pow(h,2))/12;// трапеция
    j = (j*h)/2;// левые и правые прямоугольники

	//===============================================================
    // === Метод левых прямоугольников
	//===============================================================
    for(int i = 0; i <= n-1; i++) {
        area = area + arry[i] * (arrx[i+1] - arrx[i]);
    }
    cout << "\tПодсчитанная площадь ямки" << '\n';
    cout << "=====================================================\n"
         << "Метод левых прямоугольников: "
    	 << area << " [мм^2]" << '\n'
    	 << "Погрешность: " << fabs(j) << '\n';

    area = 0;

	//===============================================================
    // === Метод правых прямоугольников
	//===============================================================
    for(int i = 1; i <= n; i++) {
        area = area + arry[i] * (arrx[i] - arrx[i-1]);
    }
    cout << "=====================================================\n"
         << "Метод правых прямоугольников: "
    	 << area << " [мм^2]" << '\n'
    	 << "Погрешность: " << fabs(j) << '\n';
    area = 0;

	//===============================================================
    // === Метод средних прямоугольников
	//===============================================================
    for(int i = 1; i < n; i = i+2) {
        area = area + arry[i] * (arrx[i] - arrx[i-1])*2;
    }
    cout << "=====================================================\n"
         << "Метод центральных прямоугольников: "
    	 << area << " [мм^2]" << '\n'
    	 << "Погрешность: " << fabs(centrect) << '\n';
    area = 0;

	//===============================================================
    // === Метод трапеции
	//===============================================================
    for(int i = 0; i < n; i++) {
        area = area + (arry[i] + arry[i+1]) * (arrx[i+1] - arrx[i])/2;
    }
    cout << "=====================================================\n"
         << "Метод трапеций: "
    	 << area << " [мм^2]" << '\n'
    	 << "Погрешность: " << fabs(trap) << '\n';
    area = 0;

	//===============================================================
    // === Метод Симпсона
	//===============================================================
    simp = pow(h,4)/2880;
    for(int i = 1; i<n; i += 2) {
        area += (arry[i-1] + 4*arry[i] + arry[i+1]);
    }
    area = area * h/3;
    cout << "=====================================================\n"
         << "Метод Симпсона: "
    	 << area << " [мм^2]" << '\n'
         <<"Погрешность = " <<  fabs(simp) << '\n' << '\n';
    std::cout << '\n';
    return 0;
}
